; ModuleID = 'enclave.so.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon.0 = type { i64, [8 x %struct.anon] }
%struct.anon = type { i8*, i8, i8 }
%struct.anon.1 = type { i64, [1 x [8 x i8]] }
%struct.KeyStoreBank = type { i8*, i8*, %struct.KeyStoreBank* }
%struct.binn_struct = type { i32, i32, i32, i32, i8*, i32, i32, i32, i32, i8*, i32, i32, void (i8*)*, %union.anon, i32 }
%union.anon = type { i64 }
%struct.ms_add_password_t = type { i32, i8*, i64, i8*, i64 }
%struct.ms_create_keystore_t = type { i32, i8*, i64 }
%struct.ms_get_password_t = type { i32, i8*, i64, i8*, i8*, i64 }
%struct.ms_encrypt_and_serialize_key_store_t = type { i32, i8* }
%struct.ms_seal_t = type { i32, i8*, i64, %struct._sealed_data_t*, i64 }
%struct._sealed_data_t = type { %struct._key_request_t, i32, [12 x i8], %struct._aes_gcm_data_t }
%struct._key_request_t = type { i16, i16, i16, i16, %struct._sgx_cpu_svn_t, %struct._attributes_t, %struct._sgx_key_id_t, i32, i16, [434 x i8] }
%struct._sgx_cpu_svn_t = type { [16 x i8] }
%struct._attributes_t = type { i64, i64 }
%struct._sgx_key_id_t = type { [32 x i8] }
%struct._aes_gcm_data_t = type { i32, [12 x i8], [16 x i8], [0 x i8] }
%struct.ms_unseal_t = type { i32, %struct._sealed_data_t*, i64, i8*, i32 }
%struct.ms_ocall_print_t = type { i8* }
%struct.binn_iter_struct = type { i8*, i8*, i32, i32, i32 }

!21 = !DIEnumerator(name: "SGX_ERROR_ECALL_NOT_ALLOWED", value: 4103)
!22 = !DIEnumerator(name: "SGX_ERROR_OCALL_NOT_ALLOWED", value: 4104)
!23 = !DIEnumerator(name: "SGX_ERROR_STACK_OVERRUN", value: 4105)
!24 = !DIEnumerator(name: "SGX_ERROR_UNDEFINED_SYMBOL", value: 8192)
!25 = !DIEnumerator(name: "SGX_ERROR_INVALID_ENCLAVE", value: 8193)
!26 = !DIEnumerator(name: "SGX_ERROR_INVALID_ENCLAVE_ID", value: 8194)
!27 = !DIEnumerator(name: "SGX_ERROR_INVALID_SIGNATURE", value: 8195)
!28 = !DIEnumerator(name: "SGX_ERROR_NDEBUG_ENCLAVE", value: 8196)
!29 = !DIEnumerator(name: "SGX_ERROR_OUT_OF_EPC", value: 8197)
!30 = !DIEnumerator(name: "SGX_ERROR_NO_DEVICE", value: 8198)
!31 = !DIEnumerator(name: "SGX_ERROR_MEMORY_MAP_CONFLICT", value: 8199)
!32 = !DIEnumerator(name: "SGX_ERROR_INVALID_METADATA", value: 8201)
!33 = !DIEnumerator(name: "SGX_ERROR_DEVICE_BUSY", value: 8204)
!34 = !DIEnumerator(name: "SGX_ERROR_INVALID_VERSION", value: 8205)
!35 = !DIEnumerator(name: "SGX_ERROR_MODE_INCOMPATIBLE", value: 8206)
!36 = !DIEnumerator(name: "SGX_ERROR_ENCLAVE_FILE_ACCESS", value: 8207)
!37 = !DIEnumerator(name: "SGX_ERROR_INVALID_MISC", value: 8208)
!38 = !DIEnumerator(name: "SGX_ERROR_INVALID_LAUNCH_TOKEN", value: 8209)
!39 = !DIEnumerator(name: "SGX_ERROR_MAC_MISMATCH", value: 12289)
!40 = !DIEnumerator(name: "SGX_ERROR_INVALID_ATTRIBUTE", value: 12290)
!41 = !DIEnumerator(name: "SGX_ERROR_INVALID_CPUSVN", value: 12291)
!42 = !DIEnumerator(name: "SGX_ERROR_INVALID_ISVSVN", value: 12292)
!43 = !DIEnumerator(name: "SGX_ERROR_INVALID_KEYNAME", value: 12293)
!44 = !DIEnumerator(name: "SGX_ERROR_SERVICE_UNAVAILABLE", value: 16385)
!45 = !DIEnumerator(name: "SGX_ERROR_SERVICE_TIMEOUT", value: 16386)
!46 = !DIEnumerator(name: "SGX_ERROR_AE_INVALID_EPIDBLOB", value: 16387)
!47 = !DIEnumerator(name: "SGX_ERROR_SERVICE_INVALID_PRIVILEGE", value: 16388)
!48 = !DIEnumerator(name: "SGX_ERROR_EPID_MEMBER_REVOKED", value: 16389)
!49 = !DIEnumerator(name: "SGX_ERROR_UPDATE_NEEDED", value: 16390)
!50 = !DIEnumerator(name: "SGX_ERROR_NETWORK_FAILURE", value: 16391)
!51 = !DIEnumerator(name: "SGX_ERROR_AE_SESSION_INVALID", value: 16392)
!52 = !DIEnumerator(name: "SGX_ERROR_BUSY", value: 16394)
!53 = !DIEnumerator(name: "SGX_ERROR_MC_NOT_FOUND", value: 16396)
!54 = !DIEnumerator(name: "SGX_ERROR_MC_NO_ACCESS_RIGHT", value: 16397)
!55 = !DIEnumerator(name: "SGX_ERROR_MC_USED_UP", value: 16398)
!56 = !DIEnumerator(name: "SGX_ERROR_MC_OVER_QUOTA", value: 16399)
!57 = !DIEnumerator(name: "SGX_ERROR_KDF_MISMATCH", value: 16401)
!58 = !DIEnumerator(name: "SGX_ERROR_UNRECOGNIZED_PLATFORM", value: 16402)
!59 = !DIEnumerator(name: "SGX_ERROR_UNSUPPORTED_CONFIG", value: 16403)
!60 = !DIEnumerator(name: "SGX_ERROR_NO_PRIVILEGE", value: 20482)
!61 = !DIEnumerator(name: "SGX_ERROR_PCL_ENCRYPTED", value: 24577)
!62 = !DIEnumerator(name: "SGX_ERROR_PCL_NOT_ENCRYPTED", value: 24578)
!63 = !DIEnumerator(name: "SGX_ERROR_PCL_MAC_MISMATCH", value: 24579)
!64 = !DIEnumerator(name: "SGX_ERROR_PCL_SHA_MISMATCH", value: 24580)
!65 = !DIEnumerator(name: "SGX_ERROR_PCL_GUID_MISMATCH", value: 24581)
!66 = !DIEnumerator(name: "SGX_ERROR_FILE_BAD_STATUS", value: 28673)
!67 = !DIEnumerator(name: "SGX_ERROR_FILE_NO_KEY_ID", value: 28674)
!68 = !DIEnumerator(name: "SGX_ERROR_FILE_NAME_MISMATCH", value: 28675)
!69 = !DIEnumerator(name: "SGX_ERROR_FILE_NOT_SGX_FILE", value: 28676)
!70 = !DIEnumerator(name: "SGX_ERROR_FILE_CANT_OPEN_RECOVERY_FILE", value: 28677)
!71 = !DIEnumerator(name: "SGX_ERROR_FILE_CANT_WRITE_RECOVERY_FILE", value: 28678)
!72 = !DIEnumerator(name: "SGX_ERROR_FILE_RECOVERY_NEEDED", value: 28679)
!73 = !DIEnumerator(name: "SGX_ERROR_FILE_FLUSH_FAILED", value: 28680)
!74 = !DIEnumerator(name: "SGX_ERROR_FILE_CLOSE_FAILED", value: 28681)
!75 = !DIEnumerator(name: "SGX_ERROR_UNSUPPORTED_ATT_KEY_ID", value: 32769)
!76 = !DIEnumerator(name: "SGX_ERROR_ATT_KEY_CERTIFICATION_FAILURE", value: 32770)
!77 = !DIEnumerator(name: "SGX_ERROR_ATT_KEY_UNINITIALIZED", value: 32771)
!78 = !DIEnumerator(name: "SGX_ERROR_INVALID_ATT_KEY_CERT_DATA", value: 32772)
!79 = !DIEnumerator(name: "SGX_ERROR_PLATFORM_CERT_UNAVAILABLE", value: 32773)
!80 = !DIEnumerator(name: "SGX_INTERNAL_ERROR_ENCLAVE_CREATE_INTERRUPTED", value: 61441)
!81 = !{!82, !83, !91, !88, !96, !103, !107, !114, !124, !130, !136, !142, !149, !156, !226}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_ocall_print_t", file: !3, line: 86, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_ocall_print_t", file: !3, line: 84, size: 64, elements: !86)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ms_str", scope: !85, file: !3, line: 85, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !92, line: 94, baseType: !93)
!92 = !DIFile(filename: "/opt/intel/sgxsdk/include/tlibc/wchar.h", directory: "")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__size_t", file: !94, line: 102, baseType: !95)
!94 = !DIFile(filename: "/opt/intel/sgxsdk/include/tlibc/sys/_types.h", directory: "")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_add_password_t", file: !3, line: 36, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_add_password_t", file: !3, line: 30, size: 320, elements: !99)
!99 = !{!100, !102, !104, !105, !106}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ms_retval", scope: !98, file: !3, line: 31, baseType: !101, size: 32)
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ms_website", scope: !98, file: !3, line: 32, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ms_website_len", scope: !98, file: !3, line: 33, baseType: !91, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ms_password", scope: !98, file: !3, line: 34, baseType: !103, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ms_password_len", scope: !98, file: !3, line: 35, baseType: !91, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_create_keystore_t", file: !3, line: 42, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_create_keystore_t", file: !3, line: 38, size: 192, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ms_retval", scope: !109, file: !3, line: 39, baseType: !101, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ms_main_password", scope: !109, file: !3, line: 40, baseType: !103, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ms_main_password_len", scope: !109, file: !3, line: 41, baseType: !91, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_get_password_t", file: !3, line: 51, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_get_password_t", file: !3, line: 44, size: 384, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ms_retval", scope: !116, file: !3, line: 45, baseType: !101, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ms_website", scope: !116, file: !3, line: 46, baseType: !103, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ms_website_len", scope: !116, file: !3, line: 47, baseType: !91, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ms_returnstr", scope: !116, file: !3, line: 48, baseType: !103, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ms_verification_password", scope: !116, file: !3, line: 49, baseType: !103, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ms_verification_password_len", scope: !116, file: !3, line: 50, baseType: !91, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_serialize_key_store_t", file: !3, line: 56, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_serialize_key_store_t", file: !3, line: 53, size: 128, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ms_retval", scope: !126, file: !3, line: 54, baseType: !101, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ms_p_dst", scope: !126, file: !3, line: 55, baseType: !82, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_decrypt_and_set_key_store_t", file: !3, line: 61, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_decrypt_and_set_key_store_t", file: !3, line: 58, size: 128, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ms_retval", scope: !132, file: !3, line: 59, baseType: !101, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ms_key_store", scope: !132, file: !3, line: 60, baseType: !82, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_encrypt_and_serialize_key_store_t", file: !3, line: 66, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_encrypt_and_serialize_key_store_t", file: !3, line: 63, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ms_retval", scope: !138, file: !3, line: 64, baseType: !101, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ms_p_dst", scope: !138, file: !3, line: 65, baseType: !82, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_seal_t", file: !3, line: 74, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_seal_t", file: !3, line: 68, size: 320, elements: !145)
!145 = !{!146, !148, !154, !155, !225}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ms_retval", scope: !144, file: !3, line: 69, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_status_t", file: !6, line: 125, baseType: !5)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ms_plaintext", scope: !144, file: !3, line: 70, baseType: !149, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !151, line: 33, baseType: !152)
!151 = !DIFile(filename: "/opt/intel/sgxsdk/include/tlibc/sys/stdint.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !94, line: 40, baseType: !153)
!153 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ms_plaintext_len", scope: !144, file: !3, line: 71, baseType: !91, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ms_sealed_data", scope: !144, file: !3, line: 72, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_sealed_data_t", file: !158, line: 62, baseType: !159)
!158 = !DIFile(filename: "/opt/intel/sgxsdk/include/sgx_tseal.h", directory: "")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sealed_data_t", file: !158, line: 56, size: 4480, elements: !160)
!160 = !{!161, !209, !210, !214}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "key_request", scope: !159, file: !158, line: 58, baseType: !162, size: 4096)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_key_request_t", file: !163, line: 94, baseType: !164)
!163 = !DIFile(filename: "/opt/intel/sgxsdk/include/sgx_key.h", directory: "")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_key_request_t", file: !163, line: 82, size: 4096, elements: !165)
!165 = !{!166, !170, !171, !173, !174, !182, !191, !199, !203, !205}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "key_name", scope: !164, file: !163, line: 84, baseType: !167, size: 16)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !151, line: 43, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !94, line: 42, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "key_policy", scope: !164, file: !163, line: 85, baseType: !167, size: 16, offset: 16)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "isv_svn", scope: !164, file: !163, line: 86, baseType: !172, size: 16, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_isv_svn_t", file: !163, line: 65, baseType: !167)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !164, file: !163, line: 87, baseType: !167, size: 16, offset: 48)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_svn", scope: !164, file: !163, line: 88, baseType: !175, size: 128, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_cpu_svn_t", file: !163, line: 73, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sgx_cpu_svn_t", file: !163, line: 70, size: 128, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "svn", scope: !176, file: !163, line: 72, baseType: !179, size: 128)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 16)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "attribute_mask", scope: !164, file: !163, line: 89, baseType: !183, size: 128, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_attributes_t", file: !184, line: 57, baseType: !185)
!184 = !DIFile(filename: "/opt/intel/sgxsdk/include/sgx_attributes.h", directory: "")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_attributes_t", file: !184, line: 53, size: 128, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !184, line: 55, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !151, line: 63, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !94, line: 47, baseType: !95)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "xfrm", scope: !185, file: !184, line: 56, baseType: !188, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "key_id", scope: !164, file: !163, line: 90, baseType: !192, size: 256, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_key_id_t", file: !163, line: 78, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sgx_key_id_t", file: !163, line: 75, size: 256, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !193, file: !163, line: 77, baseType: !196, size: 256)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "misc_mask", scope: !164, file: !163, line: 91, baseType: !200, size: 32, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_misc_select_t", file: !184, line: 60, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !151, line: 53, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !94, line: 44, baseType: !7)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "config_svn", scope: !164, file: !163, line: 92, baseType: !204, size: 16, offset: 608)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_config_svn_t", file: !163, line: 66, baseType: !167)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !164, file: !163, line: 93, baseType: !206, size: 3472, offset: 624)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 3472, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 434)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "plain_text_offset", scope: !159, file: !158, line: 59, baseType: !201, size: 32, offset: 4096)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !159, file: !158, line: 60, baseType: !211, size: 96, offset: 4128)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 12)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "aes_data", scope: !159, file: !158, line: 61, baseType: !215, size: 256, offset: 4224)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_aes_gcm_data_t", file: !158, line: 54, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_aes_gcm_data_t", file: !158, line: 48, size: 256, elements: !217)
!217 = !{!218, !219, !220, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "payload_size", scope: !216, file: !158, line: 50, baseType: !201, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !216, file: !158, line: 51, baseType: !211, size: 96, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "payload_tag", scope: !216, file: !158, line: 52, baseType: !179, size: 128, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !216, file: !158, line: 53, baseType: !222, offset: 256)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: -1)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ms_sealed_size", scope: !144, file: !3, line: 73, baseType: !91, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ms_unseal_t", file: !3, line: 82, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_unseal_t", file: !3, line: 76, size: 320, elements: !229)
!229 = !{!230, !231, !232, !233, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ms_retval", scope: !228, file: !3, line: 77, baseType: !147, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ms_sealed_data", scope: !228, file: !3, line: 78, baseType: !156, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ms_sealed_size", scope: !228, file: !3, line: 79, baseType: !91, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ms_plaintext", scope: !228, file: !3, line: 80, baseType: !149, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ms_plaintext_len", scope: !228, file: !3, line: 81, baseType: !201, size: 32, offset: 256)
!235 = !{!0, !236}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "g_dyn_entry_table", scope: !2, file: !3, line: 580, type: !238, isLocal: false, isDefinition: true)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 577, size: 128, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nr_ocall", scope: !239, file: !3, line: 578, baseType: !91, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "entry_table", scope: !239, file: !3, line: 579, baseType: !243, size: 64, offset: 64)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !244)
!244 = !{!245, !246}
!245 = !DISubrange(count: 1)
!246 = !DISubrange(count: 8)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 560, size: 1088, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nr_ecall", scope: !248, file: !3, line: 561, baseType: !91, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ecall_table", scope: !248, file: !3, line: 562, baseType: !252, size: 1024, offset: 64)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 1024, elements: !258)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !3, line: 562, size: 128, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ecall_addr", scope: !253, file: !3, line: 562, baseType: !82, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "is_priv", scope: !253, file: !3, line: 562, baseType: !150, size: 8, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "is_switchless", scope: !253, file: !3, line: 562, baseType: !150, size: 8, offset: 72)
!258 = !{!246}
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "password", scope: !261, file: !262, line: 11, type: !103, isLocal: false, isDefinition: true)
!261 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !262, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !263, retainedTypes: !338, globals: !350, splitDebugInlining: false, nameTableKind: None)
!262 = !DIFile(filename: "Enclave/Enclave.cpp", directory: "/home/yang/TODO/password-manager-master")
!263 = !{!264}
!264 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "_status_t", file: !6, line: 37, baseType: !7, size: 32, elements: !265, identifier: "_ZTS9_status_t")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!266 = !DIEnumerator(name: "SGX_SUCCESS", value: 0, isUnsigned: true)
!267 = !DIEnumerator(name: "SGX_ERROR_UNEXPECTED", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "SGX_ERROR_INVALID_PARAMETER", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "SGX_ERROR_OUT_OF_MEMORY", value: 3, isUnsigned: true)
!270 = !DIEnumerator(name: "SGX_ERROR_ENCLAVE_LOST", value: 4, isUnsigned: true)
!271 = !DIEnumerator(name: "SGX_ERROR_INVALID_STATE", value: 5, isUnsigned: true)
!272 = !DIEnumerator(name: "SGX_ERROR_FEATURE_NOT_SUPPORTED", value: 8, isUnsigned: true)
!273 = !DIEnumerator(name: "SGX_PTHREAD_EXIT", value: 9, isUnsigned: true)
!274 = !DIEnumerator(name: "SGX_ERROR_MEMORY_MAP_FAILURE", value: 10, isUnsigned: true)
!275 = !DIEnumerator(name: "SGX_ERROR_INVALID_FUNCTION", value: 4097, isUnsigned: true)
!276 = !DIEnumerator(name: "SGX_ERROR_OUT_OF_TCS", value: 4099, isUnsigned: true)
!277 = !DIEnumerator(name: "SGX_ERROR_ENCLAVE_CRASHED", value: 4102, isUnsigned: true)
!278 = !DIEnumerator(name: "SGX_ERROR_ECALL_NOT_ALLOWED", value: 4103, isUnsigned: true)
!279 = !DIEnumerator(name: "SGX_ERROR_OCALL_NOT_ALLOWED", value: 4104, isUnsigned: true)
!280 = !DIEnumerator(name: "SGX_ERROR_STACK_OVERRUN", value: 4105, isUnsigned: true)
!281 = !DIEnumerator(name: "SGX_ERROR_UNDEFINED_SYMBOL", value: 8192, isUnsigned: true)
!282 = !DIEnumerator(name: "SGX_ERROR_INVALID_ENCLAVE", value: 8193, isUnsigned: true)
!283 = !DIEnumerator(name: "SGX_ERROR_INVALID_ENCLAVE_ID", value: 8194, isUnsigned: true)
!284 = !DIEnumerator(name: "SGX_ERROR_INVALID_SIGNATURE", value: 8195, isUnsigned: true)
!285 = !DIEnumerator(name: "SGX_ERROR_NDEBUG_ENCLAVE", value: 8196, isUnsigned: true)
!286 = !DIEnumerator(name: "SGX_ERROR_OUT_OF_EPC", value: 8197, isUnsigned: true)
!287 = !DIEnumerator(name: "SGX_ERROR_NO_DEVICE", value: 8198, isUnsigned: true)
!288 = !DIEnumerator(name: "SGX_ERROR_MEMORY_MAP_CONFLICT", value: 8199, isUnsigned: true)
!289 = !DIEnumerator(name: "SGX_ERROR_INVALID_METADATA", value: 8201, isUnsigned: true)
!290 = !DIEnumerator(name: "SGX_ERROR_DEVICE_BUSY", value: 8204, isUnsigned: true)
!291 = !DIEnumerator(name: "SGX_ERROR_INVALID_VERSION", value: 8205, isUnsigned: true)
!292 = !DIEnumerator(name: "SGX_ERROR_MODE_INCOMPATIBLE", value: 8206, isUnsigned: true)
!293 = !DIEnumerator(name: "SGX_ERROR_ENCLAVE_FILE_ACCESS", value: 8207, isUnsigned: true)
!294 = !DIEnumerator(name: "SGX_ERROR_INVALID_MISC", value: 8208, isUnsigned: true)
!295 = !DIEnumerator(name: "SGX_ERROR_INVALID_LAUNCH_TOKEN", value: 8209, isUnsigned: true)
!296 = !DIEnumerator(name: "SGX_ERROR_MAC_MISMATCH", value: 12289, isUnsigned: true)
!297 = !DIEnumerator(name: "SGX_ERROR_INVALID_ATTRIBUTE", value: 12290, isUnsigned: true)
!298 = !DIEnumerator(name: "SGX_ERROR_INVALID_CPUSVN", value: 12291, isUnsigned: true)
!299 = !DIEnumerator(name: "SGX_ERROR_INVALID_ISVSVN", value: 12292, isUnsigned: true)
!300 = !DIEnumerator(name: "SGX_ERROR_INVALID_KEYNAME", value: 12293, isUnsigned: true)
!301 = !DIEnumerator(name: "SGX_ERROR_SERVICE_UNAVAILABLE", value: 16385, isUnsigned: true)
!302 = !DIEnumerator(name: "SGX_ERROR_SERVICE_TIMEOUT", value: 16386, isUnsigned: true)
!303 = !DIEnumerator(name: "SGX_ERROR_AE_INVALID_EPIDBLOB", value: 16387, isUnsigned: true)
!304 = !DIEnumerator(name: "SGX_ERROR_SERVICE_INVALID_PRIVILEGE", value: 16388, isUnsigned: true)
!305 = !DIEnumerator(name: "SGX_ERROR_EPID_MEMBER_REVOKED", value: 16389, isUnsigned: true)
!306 = !DIEnumerator(name: "SGX_ERROR_UPDATE_NEEDED", value: 16390, isUnsigned: true)
!307 = !DIEnumerator(name: "SGX_ERROR_NETWORK_FAILURE", value: 16391, isUnsigned: true)
!308 = !DIEnumerator(name: "SGX_ERROR_AE_SESSION_INVALID", value: 16392, isUnsigned: true)
!309 = !DIEnumerator(name: "SGX_ERROR_BUSY", value: 16394, isUnsigned: true)
!310 = !DIEnumerator(name: "SGX_ERROR_MC_NOT_FOUND", value: 16396, isUnsigned: true)
!311 = !DIEnumerator(name: "SGX_ERROR_MC_NO_ACCESS_RIGHT", value: 16397, isUnsigned: true)
!312 = !DIEnumerator(name: "SGX_ERROR_MC_USED_UP", value: 16398, isUnsigned: true)
!313 = !DIEnumerator(name: "SGX_ERROR_MC_OVER_QUOTA", value: 16399, isUnsigned: true)
!314 = !DIEnumerator(name: "SGX_ERROR_KDF_MISMATCH", value: 16401, isUnsigned: true)
!315 = !DIEnumerator(name: "SGX_ERROR_UNRECOGNIZED_PLATFORM", value: 16402, isUnsigned: true)
!316 = !DIEnumerator(name: "SGX_ERROR_UNSUPPORTED_CONFIG", value: 16403, isUnsigned: true)
!317 = !DIEnumerator(name: "SGX_ERROR_NO_PRIVILEGE", value: 20482, isUnsigned: true)
!318 = !DIEnumerator(name: "SGX_ERROR_PCL_ENCRYPTED", value: 24577, isUnsigned: true)
!319 = !DIEnumerator(name: "SGX_ERROR_PCL_NOT_ENCRYPTED", value: 24578, isUnsigned: true)
!320 = !DIEnumerator(name: "SGX_ERROR_PCL_MAC_MISMATCH", value: 24579, isUnsigned: true)
!321 = !DIEnumerator(name: "SGX_ERROR_PCL_SHA_MISMATCH", value: 24580, isUnsigned: true)
!322 = !DIEnumerator(name: "SGX_ERROR_PCL_GUID_MISMATCH", value: 24581, isUnsigned: true)
!323 = !DIEnumerator(name: "SGX_ERROR_FILE_BAD_STATUS", value: 28673, isUnsigned: true)
!324 = !DIEnumerator(name: "SGX_ERROR_FILE_NO_KEY_ID", value: 28674, isUnsigned: true)
!325 = !DIEnumerator(name: "SGX_ERROR_FILE_NAME_MISMATCH", value: 28675, isUnsigned: true)
!326 = !DIEnumerator(name: "SGX_ERROR_FILE_NOT_SGX_FILE", value: 28676, isUnsigned: true)
!327 = !DIEnumerator(name: "SGX_ERROR_FILE_CANT_OPEN_RECOVERY_FILE", value: 28677, isUnsigned: true)
!328 = !DIEnumerator(name: "SGX_ERROR_FILE_CANT_WRITE_RECOVERY_FILE", value: 28678, isUnsigned: true)
!329 = !DIEnumerator(name: "SGX_ERROR_FILE_RECOVERY_NEEDED", value: 28679, isUnsigned: true)
!330 = !DIEnumerator(name: "SGX_ERROR_FILE_FLUSH_FAILED", value: 28680, isUnsigned: true)
!331 = !DIEnumerator(name: "SGX_ERROR_FILE_CLOSE_FAILED", value: 28681, isUnsigned: true)
!332 = !DIEnumerator(name: "SGX_ERROR_UNSUPPORTED_ATT_KEY_ID", value: 32769, isUnsigned: true)
!333 = !DIEnumerator(name: "SGX_ERROR_ATT_KEY_CERTIFICATION_FAILURE", value: 32770, isUnsigned: true)
!334 = !DIEnumerator(name: "SGX_ERROR_ATT_KEY_UNINITIALIZED", value: 32771, isUnsigned: true)
!335 = !DIEnumerator(name: "SGX_ERROR_INVALID_ATT_KEY_CERT_DATA", value: 32772, isUnsigned: true)
!336 = !DIEnumerator(name: "SGX_ERROR_PLATFORM_CERT_UNAVAILABLE", value: 32773, isUnsigned: true)
!337 = !DIEnumerator(name: "SGX_INTERNAL_ERROR_ENCLAVE_CREATE_INTERRUPTED", value: 61441, isUnsigned: true)
!338 = !{!339, !103, !345, !149, !347, !82}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyStoreBank", file: !262, line: 16, size: 192, flags: DIFlagTypePassByValue, elements: !341, identifier: "_ZTS12KeyStoreBank")
!341 = !{!342, !343, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "website", scope: !340, file: !262, line: 18, baseType: !103, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !340, file: !262, line: 19, baseType: !103, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !262, line: 20, baseType: !339, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_aes_gcm_128bit_tag_t", file: !349, line: 110, baseType: !179)
!349 = !DIFile(filename: "/opt/intel/sgxsdk/include/sgx_tcrypto.h", directory: "")
!350 = !{!259, !351, !353, !358, !360, !362, !365, !372, !378}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "numPasswords", scope: !261, file: !262, line: 12, type: !101, isLocal: false, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "buffer", scope: !261, file: !262, line: 14, type: !355, isLocal: false, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 8192, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 1024)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "firstKey", scope: !261, file: !262, line: 23, type: !339, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "currentKey", scope: !261, file: !262, line: 24, type: !339, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression(DW_OP_constu, 1024, DW_OP_stack_value))
!363 = distinct !DIGlobalVariable(name: "MAX_PASSWORD_SIZE", scope: !261, file: !262, line: 7, type: !364, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "buf", scope: !367, file: !262, line: 131, type: !371, isLocal: true, isDefinition: true)
!367 = distinct !DISubprogram(name: "itoa", linkageName: "_Z4itoaii", scope: !262, file: !262, line: 129, type: !368, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !261, retainedNodes: !370)
!368 = !DISubroutineType(types: !369)
!369 = !{!103, !101, !101}
!370 = !{}
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 256, elements: !197)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "g_region_key", scope: !374, file: !262, line: 178, type: !377, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "encrypt_and_serialize_key_store", scope: !262, file: !262, line: 176, type: !375, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !261, retainedNodes: !370)
!375 = !DISubroutineType(types: !376)
!376 = !{!101, !82}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "sgx_aes_ctr_128bit_key_t", file: !349, line: 115, baseType: !179)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "g_region_key", scope: !380, file: !262, line: 246, type: !377, isLocal: true, isDefinition: true)
!380 = distinct !DISubprogram(name: "decrypt_and_set_key_store", scope: !262, file: !262, line: 239, type: !375, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !261, retainedNodes: !370)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "malloc_fn", scope: !383, file: !384, line: 21, type: !463, isLocal: false, isDefinition: true)
!383 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !384, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !385, globals: !451, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "Enclave/binn/binn.cpp", directory: "/home/yang/TODO/password-manager-master")
!385 = !{!386, !438, !439, !103, !405, !101, !435, !440, !153, !441, !442, !443, !90, !445, !446, !447, !448, !449, !433, !450, !413, !415, !169, !7}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "binn", file: !388, line: 257, baseType: !389)
!388 = !DIFile(filename: "Enclave/binn/binn.h", directory: "/home/yang/TODO/password-manager-master")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "binn_struct", file: !388, line: 213, size: 640, flags: DIFlagTypePassByValue, elements: !390, identifier: "_ZTS11binn_struct")
!390 = !{!391, !392, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !409, !437}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !389, file: !388, line: 214, baseType: !101, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !389, file: !388, line: 215, baseType: !393, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOL", file: !388, line: 34, baseType: !101)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !389, file: !388, line: 216, baseType: !393, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !389, file: !388, line: 217, baseType: !393, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pbuf", scope: !389, file: !388, line: 219, baseType: !82, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pre_allocated", scope: !389, file: !388, line: 220, baseType: !393, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !389, file: !388, line: 221, baseType: !101, size: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !389, file: !388, line: 222, baseType: !101, size: 32, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !389, file: !388, line: 224, baseType: !101, size: 32, offset: 288)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !389, file: !388, line: 225, baseType: !82, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !389, file: !388, line: 226, baseType: !101, size: 32, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !389, file: !388, line: 227, baseType: !101, size: 32, offset: 416)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "freefn", scope: !389, file: !388, line: 229, baseType: !405, size: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "binn_mem_free", file: !388, line: 205, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !82}
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !389, file: !388, line: 231, baseType: !410, size: 64, offset: 512)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !389, file: !388, line: 231, size: 64, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !411, identifier: "_ZTSN11binn_structUt_E")
!411 = !{!412, !414, !416, !417, !420, !421, !422, !423, !426, !427, !428, !429, !430, !431, !432, !434, !436}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "vint8", scope: !410, file: !388, line: 232, baseType: !413, size: 8)
!413 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vint16", scope: !410, file: !388, line: 233, baseType: !415, size: 16)
!415 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vint32", scope: !410, file: !388, line: 234, baseType: !101, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vint64", scope: !410, file: !388, line: 235, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !388, line: 68, baseType: !419)
!419 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vuint8", scope: !410, file: !388, line: 236, baseType: !153, size: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vuint16", scope: !410, file: !388, line: 237, baseType: !169, size: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vuint32", scope: !410, file: !388, line: 238, baseType: !7, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vuint64", scope: !410, file: !388, line: 239, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !388, line: 69, baseType: !425)
!425 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "vchar", scope: !410, file: !388, line: 241, baseType: !413, size: 8)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vuchar", scope: !410, file: !388, line: 242, baseType: !153, size: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vshort", scope: !410, file: !388, line: 243, baseType: !415, size: 16)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "vushort", scope: !410, file: !388, line: 244, baseType: !169, size: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vint", scope: !410, file: !388, line: 245, baseType: !101, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vuint", scope: !410, file: !388, line: 246, baseType: !7, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vfloat", scope: !410, file: !388, line: 248, baseType: !433, size: 32)
!433 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vdouble", scope: !410, file: !388, line: 249, baseType: !435, size: 64)
!435 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vbool", scope: !410, file: !388, line: 251, baseType: !393, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "disable_int_compression", scope: !389, file: !388, line: 254, baseType: !393, size: 32, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!451 = !{!381, !452, !459, !461}
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "realloc_fn", scope: !383, file: !384, line: 22, type: !454, isLocal: false, isDefinition: true)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!82, !82, !457}
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !458, line: 47, baseType: !93)
!458 = !DIFile(filename: "/opt/intel/sgxsdk/include/tlibc/stdio.h", directory: "")
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "free_fn", scope: !383, file: !384, line: 23, type: !406, isLocal: false, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "local_value", scope: !383, file: !384, line: 1433, type: !387, isLocal: false, isDefinition: true)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!82, !457}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "initial_state", linkageName: "_ZL13initial_state", scope: !468, file: !469, line: 204, type: !483, isLocal: true, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !469, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !470, globals: !473, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "Enclave/scrypt/sha256.cpp", directory: "/home/yang/TODO/password-manager-master")
!470 = !{!471, !201, !345, !188, !149}
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !472, line: 42, baseType: !93)
!472 = !DIFile(filename: "/opt/intel/sgxsdk/include/tlibc/string.h", directory: "")
!473 = !{!466, !474, !480}
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "Krnd", linkageName: "_ZL4Krnd", scope: !468, file: !469, line: 49, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 2048, elements: !478)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!478 = !{!479}
!479 = !DISubrange(count: 64)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "PAD", linkageName: "_ZL3PAD", scope: !468, file: !469, line: 163, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 512, elements: !478)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 256, elements: !258)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "insecure_memzero_ptr", scope: !486, file: !487, line: 18, type: !492, isLocal: false, isDefinition: true)
!486 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !487, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !488, globals: !491, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "Enclave/scrypt/insecure_memzero.cpp", directory: "/home/yang/TODO/password-manager-master")
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!491 = !{!484}
!492 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !496, !498}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !499, line: 48, baseType: !93)
!499 = !DIFile(filename: "/opt/intel/sgxsdk/include/tlibc/stddef.h", directory: "")
!500 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !501, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !263, retainedTypes: !502, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "Enclave/Sealing/Sealing.cpp", directory: "/home/yang/TODO/password-manager-master")
!502 = !{!149}
!503 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !504, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !505, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "Enclave/scrypt/crypto_scrypt.cpp", directory: "/home/yang/TODO/password-manager-master")
!505 = !{!188, !149, !506, !508}
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !151, line: 94, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintptr_t", file: !94, line: 98, baseType: !189)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!509 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !510, producer: "clang version 13.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !511, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "Enclave/scrypt/crypto_scrypt_smix.cpp", directory: "/home/yang/TODO/password-manager-master")
!511 = !{!508, !149, !345, !201, !512, !513, !515, !506, !188}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!516 = !{!"clang version 13.0.0"}
!517 = !{i32 7, !"Dwarf Version", i32 4}
!518 = !{i32 2, !"Debug Info Version", i32 3}
!519 = !{i32 1, !"wchar_size", i32 4}
!520 = !{i32 7, !"PIC Level", i32 1}
!521 = !{i32 7, !"PIE Level", i32 1}
!522 = !{i32 7, !"uwtable", i32 1}
!523 = !{i32 7, !"frame-pointer", i32 2}
!524 = distinct !DISubprogram(name: "sgx_add_password", scope: !3, file: !3, line: 88, type: !525, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !370)
!525 = !DISubroutineType(types: !526)
!526 = !{!147, !82}
!527 = !DILocalVariable(name: "pms", arg: 1, scope: !524, file: !3, line: 88, type: !82)
!528 = !DILocation(line: 88, column: 54, scope: !524)
!529 = !DILocation(line: 90, column: 2, scope: !524)
!530 = !DILocation(line: 90, column: 2, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 90, column: 2)
!532 = distinct !DILexicalBlock(scope: !524, file: !3, line: 90, column: 2)
!533 = !DILocation(line: 90, column: 2, scope: !532)
!534 = !DILocation(line: 94, column: 2, scope: !524)
!535 = !DILocalVariable(name: "ms", scope: !524, file: !3, line: 95, type: !96)
!536 = !DILocation(line: 95, column: 21, scope: !524)
!537 = !DILocation(line: 95, column: 26, scope: !524)
!538 = !DILocalVariable(name: "status", scope: !524, file: !3, line: 96, type: !147)
!539 = !DILocation(line: 96, column: 15, scope: !524)
!540 = !DILocalVariable(name: "_tmp_website", scope: !524, file: !3, line: 97, type: !103)
!541 = !DILocation(line: 97, column: 8, scope: !524)
!542 = !DILocation(line: 97, column: 23, scope: !524)
!543 = !DILocation(line: 97, column: 27, scope: !524)
!544 = !DILocalVariable(name: "_len_website", scope: !524, file: !3, line: 98, type: !91)
!545 = !DILocation(line: 98, column: 9, scope: !524)
!546 = !DILocation(line: 98, column: 24, scope: !524)
!547 = !DILocation(line: 98, column: 28, scope: !524)
!548 = !DILocalVariable(name: "_in_website", scope: !524, file: !3, line: 99, type: !103)
!549 = !DILocation(line: 99, column: 8, scope: !524)
!550 = !DILocalVariable(name: "_tmp_password", scope: !524, file: !3, line: 100, type: !103)
!551 = !DILocation(line: 100, column: 8, scope: !524)
!552 = !DILocation(line: 100, column: 24, scope: !524)
!553 = !DILocation(line: 100, column: 28, scope: !524)
!554 = !DILocalVariable(name: "_len_password", scope: !524, file: !3, line: 101, type: !91)
!555 = !DILocation(line: 101, column: 9, scope: !524)
!556 = !DILocation(line: 101, column: 25, scope: !524)
!557 = !DILocation(line: 101, column: 29, scope: !524)
!558 = !DILocalVariable(name: "_in_password", scope: !524, file: !3, line: 102, type: !103)
!559 = !DILocation(line: 102, column: 8, scope: !524)
!560 = !DILocation(line: 104, column: 2, scope: !524)
!561 = !DILocation(line: 104, column: 2, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !3, line: 104, column: 2)
!563 = distinct !DILexicalBlock(scope: !524, file: !3, line: 104, column: 2)
!564 = !DILocation(line: 104, column: 2, scope: !563)
!565 = !DILocation(line: 105, column: 2, scope: !524)
!566 = !DILocation(line: 105, column: 2, scope: !567)
!567 = distinct !DILexicalBlock(scope: !568, file: !3, line: 105, column: 2)
!568 = distinct !DILexicalBlock(scope: !524, file: !3, line: 105, column: 2)
!569 = !DILocation(line: 105, column: 2, scope: !568)
!570 = !DILocation(line: 110, column: 2, scope: !524)
!571 = !DILocation(line: 112, column: 6, scope: !572)
!572 = distinct !DILexicalBlock(scope: !524, file: !3, line: 112, column: 6)
!573 = !DILocation(line: 112, column: 19, scope: !572)
!574 = !DILocation(line: 112, column: 27, scope: !572)
!575 = !DILocation(line: 112, column: 30, scope: !572)
!576 = !DILocation(line: 112, column: 43, scope: !572)
!577 = !DILocation(line: 112, column: 6, scope: !524)
!578 = !DILocation(line: 113, column: 31, scope: !579)
!579 = distinct !DILexicalBlock(scope: !572, file: !3, line: 112, column: 49)
!580 = !DILocation(line: 113, column: 24, scope: !579)
!581 = !DILocation(line: 113, column: 15, scope: !579)
!582 = !DILocation(line: 114, column: 7, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !3, line: 114, column: 7)
!584 = !DILocation(line: 114, column: 19, scope: !583)
!585 = !DILocation(line: 114, column: 7, scope: !579)
!586 = !DILocation(line: 115, column: 11, scope: !587)
!587 = distinct !DILexicalBlock(scope: !583, file: !3, line: 114, column: 28)
!588 = !DILocation(line: 116, column: 4, scope: !587)
!589 = !DILocation(line: 119, column: 16, scope: !590)
!590 = distinct !DILexicalBlock(scope: !579, file: !3, line: 119, column: 7)
!591 = !DILocation(line: 119, column: 29, scope: !590)
!592 = !DILocation(line: 119, column: 43, scope: !590)
!593 = !DILocation(line: 119, column: 57, scope: !590)
!594 = !DILocation(line: 119, column: 7, scope: !590)
!595 = !DILocation(line: 119, column: 7, scope: !579)
!596 = !DILocation(line: 120, column: 11, scope: !597)
!597 = distinct !DILexicalBlock(scope: !590, file: !3, line: 119, column: 72)
!598 = !DILocation(line: 121, column: 4, scope: !597)
!599 = !DILocation(line: 124, column: 3, scope: !579)
!600 = !DILocation(line: 124, column: 15, scope: !579)
!601 = !DILocation(line: 124, column: 28, scope: !579)
!602 = !DILocation(line: 124, column: 33, scope: !579)
!603 = !DILocation(line: 125, column: 7, scope: !604)
!604 = distinct !DILexicalBlock(scope: !579, file: !3, line: 125, column: 7)
!605 = !DILocation(line: 125, column: 30, scope: !604)
!606 = !DILocation(line: 125, column: 23, scope: !604)
!607 = !DILocation(line: 125, column: 43, scope: !604)
!608 = !DILocation(line: 125, column: 20, scope: !604)
!609 = !DILocation(line: 125, column: 7, scope: !579)
!610 = !DILocation(line: 127, column: 11, scope: !611)
!611 = distinct !DILexicalBlock(scope: !604, file: !3, line: 126, column: 3)
!612 = !DILocation(line: 128, column: 4, scope: !611)
!613 = !DILocation(line: 130, column: 2, scope: !579)
!614 = !DILocation(line: 131, column: 6, scope: !615)
!615 = distinct !DILexicalBlock(scope: !524, file: !3, line: 131, column: 6)
!616 = !DILocation(line: 131, column: 20, scope: !615)
!617 = !DILocation(line: 131, column: 28, scope: !615)
!618 = !DILocation(line: 131, column: 31, scope: !615)
!619 = !DILocation(line: 131, column: 45, scope: !615)
!620 = !DILocation(line: 131, column: 6, scope: !524)
!621 = !DILocation(line: 132, column: 32, scope: !622)
!622 = distinct !DILexicalBlock(scope: !615, file: !3, line: 131, column: 51)
!623 = !DILocation(line: 132, column: 25, scope: !622)
!624 = !DILocation(line: 132, column: 16, scope: !622)
!625 = !DILocation(line: 133, column: 7, scope: !626)
!626 = distinct !DILexicalBlock(scope: !622, file: !3, line: 133, column: 7)
!627 = !DILocation(line: 133, column: 20, scope: !626)
!628 = !DILocation(line: 133, column: 7, scope: !622)
!629 = !DILocation(line: 134, column: 11, scope: !630)
!630 = distinct !DILexicalBlock(scope: !626, file: !3, line: 133, column: 29)
!631 = !DILocation(line: 135, column: 4, scope: !630)
!632 = !DILocation(line: 138, column: 16, scope: !633)
!633 = distinct !DILexicalBlock(scope: !622, file: !3, line: 138, column: 7)
!634 = !DILocation(line: 138, column: 30, scope: !633)
!635 = !DILocation(line: 138, column: 45, scope: !633)
!636 = !DILocation(line: 138, column: 60, scope: !633)
!637 = !DILocation(line: 138, column: 7, scope: !633)
!638 = !DILocation(line: 138, column: 7, scope: !622)
!639 = !DILocation(line: 139, column: 11, scope: !640)
!640 = distinct !DILexicalBlock(scope: !633, file: !3, line: 138, column: 76)
!641 = !DILocation(line: 140, column: 4, scope: !640)
!642 = !DILocation(line: 143, column: 3, scope: !622)
!643 = !DILocation(line: 143, column: 16, scope: !622)
!644 = !DILocation(line: 143, column: 30, scope: !622)
!645 = !DILocation(line: 143, column: 35, scope: !622)
!646 = !DILocation(line: 144, column: 7, scope: !647)
!647 = distinct !DILexicalBlock(scope: !622, file: !3, line: 144, column: 7)
!648 = !DILocation(line: 144, column: 31, scope: !647)
!649 = !DILocation(line: 144, column: 24, scope: !647)
!650 = !DILocation(line: 144, column: 45, scope: !647)
!651 = !DILocation(line: 144, column: 21, scope: !647)
!652 = !DILocation(line: 144, column: 7, scope: !622)
!653 = !DILocation(line: 146, column: 11, scope: !654)
!654 = distinct !DILexicalBlock(scope: !647, file: !3, line: 145, column: 3)
!655 = !DILocation(line: 147, column: 4, scope: !654)
!656 = !DILocation(line: 149, column: 2, scope: !622)
!657 = !DILocation(line: 151, column: 31, scope: !524)
!658 = !DILocation(line: 151, column: 44, scope: !524)
!659 = !DILocation(line: 151, column: 18, scope: !524)
!660 = !DILocation(line: 151, column: 2, scope: !524)
!661 = !DILocation(line: 151, column: 6, scope: !524)
!662 = !DILocation(line: 151, column: 16, scope: !524)
!663 = !DILabel(scope: !524, name: "err", file: !3, line: 153)
!664 = !DILocation(line: 153, column: 1, scope: !524)
!665 = !DILocation(line: 154, column: 6, scope: !666)
!666 = distinct !DILexicalBlock(scope: !524, file: !3, line: 154, column: 6)
!667 = !DILocation(line: 154, column: 6, scope: !524)
!668 = !DILocation(line: 154, column: 24, scope: !666)
!669 = !DILocation(line: 154, column: 19, scope: !666)
!670 = !DILocation(line: 155, column: 6, scope: !671)
!671 = distinct !DILexicalBlock(scope: !524, file: !3, line: 155, column: 6)
!672 = !DILocation(line: 155, column: 6, scope: !524)
!673 = !DILocation(line: 155, column: 25, scope: !671)
!674 = !DILocation(line: 155, column: 20, scope: !671)
!675 = !DILocation(line: 156, column: 9, scope: !524)
!676 = !DILocation(line: 156, column: 2, scope: !524)
!677 = !DILocation(line: 157, column: 1, scope: !524)
!678 = distinct !DISubprogram(name: "sgx_create_keystore", scope: !3, file: !3, line: 159, type: !525, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !370)
!679 = !DILocalVariable(name: "pms", arg: 1, scope: !678, file: !3, line: 159, type: !82)
!680 = !DILocation(line: 159, column: 57, scope: !678)
!681 = !DILocation(line: 161, column: 2, scope: !678)
!682 = !DILocation(line: 161, column: 2, scope: !683)
!683 = distinct !DILexicalBlock(scope: !684, file: !3, line: 161, column: 2)
!684 = distinct !DILexicalBlock(scope: !678, file: !3, line: 161, column: 2)
!685 = !DILocation(line: 161, column: 2, scope: !684)
!686 = !DILocation(line: 165, column: 2, scope: !678)
!687 = !DILocalVariable(name: "ms", scope: !678, file: !3, line: 166, type: !107)
!688 = !DILocation(line: 166, column: 24, scope: !678)
!689 = !DILocation(line: 166, column: 29, scope: !678)
!690 = !DILocalVariable(name: "status", scope: !678, file: !3, line: 167, type: !147)
!691 = !DILocation(line: 167, column: 15, scope: !678)
!692 = !DILocalVariable(name: "_tmp_main_password", scope: !678, file: !3, line: 168, type: !103)
!693 = !DILocation(line: 168, column: 8, scope: !678)
!694 = !DILocation(line: 168, column: 29, scope: !678)
!695 = !DILocation(line: 168, column: 33, scope: !678)
!696 = !DILocalVariable(name: "_len_main_password", scope: !678, file: !3, line: 169, type: !91)
!697 = !DILocation(line: 169, column: 9, scope: !678)
!698 = !DILocation(line: 169, column: 30, scope: !678)
!699 = !DILocation(line: 169, column: 34, scope: !678)
!700 = !DILocalVariable(name: "_in_main_password", scope: !678, file: !3, line: 170, type: !103)
!701 = !DILocation(line: 170, column: 8, scope: !678)
!702 = !DILocation(line: 172, column: 2, scope: !678)
!703 = !DILocation(line: 172, column: 2, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !3, line: 172, column: 2)
!705 = distinct !DILexicalBlock(scope: !678, file: !3, line: 172, column: 2)
!706 = !DILocation(line: 172, column: 2, scope: !705)
!707 = !DILocation(line: 177, column: 2, scope: !678)
!708 = !DILocation(line: 179, column: 6, scope: !709)
!709 = distinct !DILexicalBlock(scope: !678, file: !3, line: 179, column: 6)
!710 = !DILocation(line: 179, column: 25, scope: !709)
!711 = !DILocation(line: 179, column: 33, scope: !709)
!712 = !DILocation(line: 179, column: 36, scope: !709)
!713 = !DILocation(line: 179, column: 55, scope: !709)
!714 = !DILocation(line: 179, column: 6, scope: !678)
!715 = !DILocation(line: 180, column: 37, scope: !716)
!716 = distinct !DILexicalBlock(scope: !709, file: !3, line: 179, column: 61)
!717 = !DILocation(line: 180, column: 30, scope: !716)
!718 = !DILocation(line: 180, column: 21, scope: !716)
!719 = !DILocation(line: 181, column: 7, scope: !720)
!720 = distinct !DILexicalBlock(scope: !716, file: !3, line: 181, column: 7)
!721 = !DILocation(line: 181, column: 25, scope: !720)
!722 = !DILocation(line: 181, column: 7, scope: !716)
!723 = !DILocation(line: 182, column: 11, scope: !724)
!724 = distinct !DILexicalBlock(scope: !720, file: !3, line: 181, column: 34)
!725 = !DILocation(line: 183, column: 4, scope: !724)
!726 = !DILocation(line: 186, column: 16, scope: !727)
!727 = distinct !DILexicalBlock(scope: !716, file: !3, line: 186, column: 7)
!728 = !DILocation(line: 186, column: 35, scope: !727)
!729 = !DILocation(line: 186, column: 55, scope: !727)
!730 = !DILocation(line: 186, column: 75, scope: !727)
!731 = !DILocation(line: 186, column: 7, scope: !727)
!732 = !DILocation(line: 186, column: 7, scope: !716)
!733 = !DILocation(line: 187, column: 11, scope: !734)
!734 = distinct !DILexicalBlock(scope: !727, file: !3, line: 186, column: 96)
!735 = !DILocation(line: 188, column: 4, scope: !734)
!736 = !DILocation(line: 191, column: 3, scope: !716)
!737 = !DILocation(line: 191, column: 21, scope: !716)
!738 = !DILocation(line: 191, column: 40, scope: !716)
!739 = !DILocation(line: 191, column: 45, scope: !716)
!740 = !DILocation(line: 192, column: 7, scope: !741)
!741 = distinct !DILexicalBlock(scope: !716, file: !3, line: 192, column: 7)
!742 = !DILocation(line: 192, column: 36, scope: !741)
!743 = !DILocation(line: 192, column: 29, scope: !741)
!744 = !DILocation(line: 192, column: 55, scope: !741)
!745 = !DILocation(line: 192, column: 26, scope: !741)
!746 = !DILocation(line: 192, column: 7, scope: !716)
!747 = !DILocation(line: 194, column: 11, scope: !748)
!748 = distinct !DILexicalBlock(scope: !741, file: !3, line: 193, column: 3)
!749 = !DILocation(line: 195, column: 4, scope: !748)
!750 = !DILocation(line: 197, column: 2, scope: !716)
!751 = !DILocation(line: 199, column: 34, scope: !678)
!752 = !DILocation(line: 199, column: 18, scope: !678)
!753 = !DILocation(line: 199, column: 2, scope: !678)
!754 = !DILocation(line: 199, column: 6, scope: !678)
!755 = !DILocation(line: 199, column: 16, scope: !678)
!756 = !DILabel(scope: !678, name: "err", file: !3, line: 201)
!757 = !DILocation(line: 201, column: 1, scope: !678)
!758 = !DILocation(line: 202, column: 6, scope: !759)
!759 = distinct !DILexicalBlock(scope: !678, file: !3, line: 202, column: 6)
!760 = !DILocation(line: 202, column: 6, scope: !678)
!761 = !DILocation(line: 202, column: 30, scope: !759)
!762 = !DILocation(line: 202, column: 25, scope: !759)
!763 = !DILocation(line: 203, column: 9, scope: !678)
!764 = !DILocation(line: 203, column: 2, scope: !678)
!765 = !DILocation(line: 204, column: 1, scope: !678)
!766 = distinct !DISubprogram(name: "sgx_get_password", scope: !3, file: !3, line: 206, type: !525, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !370)
!767 = !DILocalVariable(name: "pms", arg: 1, scope: !766, file: !3, line: 206, type: !82)
!768 = !DILocation(line: 206, column: 54, scope: !766)
!769 = !DILocation(line: 208, column: 2, scope: !766)
!770 = !DILocation(line: 208, column: 2, scope: !771)
!771 = distinct !DILexicalBlock(scope: !772, file: !3, line: 208, column: 2)
!772 = distinct !DILexicalBlock(scope: !766, file: !3, line: 208, column: 2)
!773 = !DILocation(line: 208, column: 2, scope: !772)
!774 = !DILocation(line: 212, column: 2, scope: !766)
!775 = !DILocalVariable(name: "ms", scope: !766, file: !3, line: 213, type: !114)
!776 = !DILocation(line: 213, column: 21, scope: !766)
!777 = !DILocation(line: 213, column: 26, scope: !766)
!778 = !DILocalVariable(name: "status", scope: !766, file: !3, line: 214, type: !147)
!779 = !DILocation(line: 214, column: 15, scope: !766)
!780 = !DILocalVariable(name: "_tmp_website", scope: !766, file: !3, line: 215, type: !103)
!781 = !DILocation(line: 215, column: 8, scope: !766)
!782 = !DILocation(line: 215, column: 23, scope: !766)
!783 = !DILocation(line: 215, column: 27, scope: !766)
!784 = !DILocalVariable(name: "_len_website", scope: !766, file: !3, line: 216, type: !91)
!785 = !DILocation(line: 216, column: 9, scope: !766)
!786 = !DILocation(line: 216, column: 24, scope: !766)
!787 = !DILocation(line: 216, column: 28, scope: !766)
!788 = !DILocalVariable(name: "_in_website", scope: !766, file: !3, line: 217, type: !103)
!789 = !DILocation(line: 217, column: 8, scope: !766)
!790 = !DILocalVariable(name: "_tmp_returnstr", scope: !766, file: !3, line: 218, type: !103)
!791 = !DILocation(line: 218, column: 8, scope: !766)
!792 = !DILocation(line: 218, column: 25, scope: !766)
!793 = !DILocation(line: 218, column: 29, scope: !766)
!794 = !DILocalVariable(name: "_len_returnstr", scope: !766, file: !3, line: 219, type: !91)
!795 = !DILocation(line: 219, column: 9, scope: !766)
!796 = !DILocalVariable(name: "_in_returnstr", scope: !766, file: !3, line: 220, type: !103)
!797 = !DILocation(line: 220, column: 8, scope: !766)
!798 = !DILocalVariable(name: "_tmp_verification_password", scope: !766, file: !3, line: 221, type: !103)
!799 = !DILocation(line: 221, column: 8, scope: !766)
!800 = !DILocation(line: 221, column: 37, scope: !766)
!801 = !DILocation(line: 221, column: 41, scope: !766)
!802 = !DILocalVariable(name: "_len_verification_password", scope: !766, file: !3, line: 222, type: !91)
!803 = !DILocation(line: 222, column: 9, scope: !766)
!804 = !DILocation(line: 222, column: 38, scope: !766)
!805 = !DILocation(line: 222, column: 42, scope: !766)
!806 = !DILocalVariable(name: "_in_verification_password", scope: !766, file: !3, line: 223, type: !103)
!807 = !DILocation(line: 223, column: 8, scope: !766)
!808 = !DILocation(line: 225, column: 2, scope: !766)
!809 = !DILocation(line: 225, column: 2, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !3, line: 225, column: 2)
!811 = distinct !DILexicalBlock(scope: !766, file: !3, line: 225, column: 2)
!812 = !DILocation(line: 225, column: 2, scope: !811)
!813 = !DILocation(line: 226, column: 2, scope: !766)
!814 = !DILocation(line: 226, column: 2, scope: !815)
!815 = distinct !DILexicalBlock(scope: !816, file: !3, line: 226, column: 2)
!816 = distinct !DILexicalBlock(scope: !766, file: !3, line: 226, column: 2)
!817 = !DILocation(line: 226, column: 2, scope: !816)
!818 = !DILocation(line: 227, column: 2, scope: !766)
!819 = !DILocation(line: 227, column: 2, scope: !820)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 227, column: 2)
!821 = distinct !DILexicalBlock(scope: !766, file: !3, line: 227, column: 2)
!822 = !DILocation(line: 227, column: 2, scope: !821)
!823 = !DILocation(line: 232, column: 2, scope: !766)
!824 = !DILocation(line: 234, column: 6, scope: !825)
!825 = distinct !DILexicalBlock(scope: !766, file: !3, line: 234, column: 6)
!826 = !DILocation(line: 234, column: 19, scope: !825)
!827 = !DILocation(line: 234, column: 27, scope: !825)
!828 = !DILocation(line: 234, column: 30, scope: !825)
!829 = !DILocation(line: 234, column: 43, scope: !825)
!830 = !DILocation(line: 234, column: 6, scope: !766)
!831 = !DILocation(line: 235, column: 31, scope: !832)
!832 = distinct !DILexicalBlock(scope: !825, file: !3, line: 234, column: 49)
!833 = !DILocation(line: 235, column: 24, scope: !832)
!834 = !DILocation(line: 235, column: 15, scope: !832)
!835 = !DILocation(line: 236, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !832, file: !3, line: 236, column: 7)
!837 = !DILocation(line: 236, column: 19, scope: !836)
!838 = !DILocation(line: 236, column: 7, scope: !832)
!839 = !DILocation(line: 237, column: 11, scope: !840)
!840 = distinct !DILexicalBlock(scope: !836, file: !3, line: 236, column: 28)
!841 = !DILocation(line: 238, column: 4, scope: !840)
!842 = !DILocation(line: 241, column: 16, scope: !843)
!843 = distinct !DILexicalBlock(scope: !832, file: !3, line: 241, column: 7)
!844 = !DILocation(line: 241, column: 29, scope: !843)
!845 = !DILocation(line: 241, column: 43, scope: !843)
!846 = !DILocation(line: 241, column: 57, scope: !843)
!847 = !DILocation(line: 241, column: 7, scope: !843)
!848 = !DILocation(line: 241, column: 7, scope: !832)
!849 = !DILocation(line: 242, column: 11, scope: !850)
!850 = distinct !DILexicalBlock(scope: !843, file: !3, line: 241, column: 72)
!851 = !DILocation(line: 243, column: 4, scope: !850)
!852 = !DILocation(line: 246, column: 3, scope: !832)
!853 = !DILocation(line: 246, column: 15, scope: !832)
!854 = !DILocation(line: 246, column: 28, scope: !832)
!855 = !DILocation(line: 246, column: 33, scope: !832)
!856 = !DILocation(line: 247, column: 7, scope: !857)
!857 = distinct !DILexicalBlock(scope: !832, file: !3, line: 247, column: 7)
!858 = !DILocation(line: 247, column: 30, scope: !857)
!859 = !DILocation(line: 247, column: 23, scope: !857)
!860 = !DILocation(line: 247, column: 43, scope: !857)
!861 = !DILocation(line: 247, column: 20, scope: !857)
!862 = !DILocation(line: 247, column: 7, scope: !832)
!863 = !DILocation(line: 249, column: 11, scope: !864)
!864 = distinct !DILexicalBlock(scope: !857, file: !3, line: 248, column: 3)
!865 = !DILocation(line: 250, column: 4, scope: !864)
!866 = !DILocation(line: 252, column: 2, scope: !832)
!867 = !DILocation(line: 253, column: 6, scope: !868)
!868 = distinct !DILexicalBlock(scope: !766, file: !3, line: 253, column: 6)
!869 = !DILocation(line: 253, column: 21, scope: !868)
!870 = !DILocation(line: 253, column: 29, scope: !868)
!871 = !DILocation(line: 253, column: 32, scope: !868)
!872 = !DILocation(line: 253, column: 47, scope: !868)
!873 = !DILocation(line: 253, column: 6, scope: !766)
!874 = !DILocation(line: 254, column: 8, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !3, line: 254, column: 8)
!876 = distinct !DILexicalBlock(scope: !868, file: !3, line: 253, column: 53)
!877 = !DILocation(line: 254, column: 23, scope: !875)
!878 = !DILocation(line: 254, column: 49, scope: !875)
!879 = !DILocation(line: 254, column: 8, scope: !876)
!880 = !DILocation(line: 256, column: 11, scope: !881)
!881 = distinct !DILexicalBlock(scope: !875, file: !3, line: 255, column: 3)
!882 = !DILocation(line: 257, column: 4, scope: !881)
!883 = !DILocation(line: 259, column: 38, scope: !884)
!884 = distinct !DILexicalBlock(scope: !876, file: !3, line: 259, column: 7)
!885 = !DILocation(line: 259, column: 31, scope: !884)
!886 = !DILocation(line: 259, column: 22, scope: !884)
!887 = !DILocation(line: 259, column: 55, scope: !884)
!888 = !DILocation(line: 259, column: 7, scope: !876)
!889 = !DILocation(line: 260, column: 11, scope: !890)
!890 = distinct !DILexicalBlock(scope: !884, file: !3, line: 259, column: 64)
!891 = !DILocation(line: 261, column: 4, scope: !890)
!892 = !DILocation(line: 264, column: 17, scope: !876)
!893 = !DILocation(line: 264, column: 35, scope: !876)
!894 = !DILocation(line: 264, column: 3, scope: !876)
!895 = !DILocation(line: 265, column: 2, scope: !876)
!896 = !DILocation(line: 266, column: 6, scope: !897)
!897 = distinct !DILexicalBlock(scope: !766, file: !3, line: 266, column: 6)
!898 = !DILocation(line: 266, column: 33, scope: !897)
!899 = !DILocation(line: 266, column: 41, scope: !897)
!900 = !DILocation(line: 266, column: 44, scope: !897)
!901 = !DILocation(line: 266, column: 71, scope: !897)
!902 = !DILocation(line: 266, column: 6, scope: !766)
!903 = !DILocation(line: 267, column: 45, scope: !904)
!904 = distinct !DILexicalBlock(scope: !897, file: !3, line: 266, column: 77)
!905 = !DILocation(line: 267, column: 38, scope: !904)
!906 = !DILocation(line: 267, column: 29, scope: !904)
!907 = !DILocation(line: 268, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !904, file: !3, line: 268, column: 7)
!909 = !DILocation(line: 268, column: 33, scope: !908)
!910 = !DILocation(line: 268, column: 7, scope: !904)
!911 = !DILocation(line: 269, column: 11, scope: !912)
!912 = distinct !DILexicalBlock(scope: !908, file: !3, line: 268, column: 42)
!913 = !DILocation(line: 270, column: 4, scope: !912)
!914 = !DILocation(line: 273, column: 16, scope: !915)
!915 = distinct !DILexicalBlock(scope: !904, file: !3, line: 273, column: 7)
!916 = !DILocation(line: 273, column: 43, scope: !915)
!917 = !DILocation(line: 273, column: 71, scope: !915)
!918 = !DILocation(line: 273, column: 99, scope: !915)
!919 = !DILocation(line: 273, column: 7, scope: !915)
!920 = !DILocation(line: 273, column: 7, scope: !904)
!921 = !DILocation(line: 274, column: 11, scope: !922)
!922 = distinct !DILexicalBlock(scope: !915, file: !3, line: 273, column: 128)
!923 = !DILocation(line: 275, column: 4, scope: !922)
!924 = !DILocation(line: 278, column: 3, scope: !904)
!925 = !DILocation(line: 278, column: 29, scope: !904)
!926 = !DILocation(line: 278, column: 56, scope: !904)
!927 = !DILocation(line: 278, column: 61, scope: !904)
!928 = !DILocation(line: 279, column: 7, scope: !929)
!929 = distinct !DILexicalBlock(scope: !904, file: !3, line: 279, column: 7)
!930 = !DILocation(line: 279, column: 44, scope: !929)
!931 = !DILocation(line: 279, column: 37, scope: !929)
!932 = !DILocation(line: 279, column: 71, scope: !929)
!933 = !DILocation(line: 279, column: 34, scope: !929)
!934 = !DILocation(line: 279, column: 7, scope: !904)
!935 = !DILocation(line: 281, column: 11, scope: !936)
!936 = distinct !DILexicalBlock(scope: !929, file: !3, line: 280, column: 3)
!937 = !DILocation(line: 282, column: 4, scope: !936)
!938 = !DILocation(line: 284, column: 2, scope: !904)
!939 = !DILocation(line: 286, column: 31, scope: !766)
!940 = !DILocation(line: 286, column: 44, scope: !766)
!941 = !DILocation(line: 286, column: 59, scope: !766)
!942 = !DILocation(line: 286, column: 18, scope: !766)
!943 = !DILocation(line: 286, column: 2, scope: !766)
!944 = !DILocation(line: 286, column: 6, scope: !766)
!945 = !DILocation(line: 286, column: 16, scope: !766)
!946 = !DILocation(line: 287, column: 6, scope: !947)
!947 = distinct !DILexicalBlock(scope: !766, file: !3, line: 287, column: 6)
!948 = !DILocation(line: 287, column: 6, scope: !766)
!949 = !DILocation(line: 288, column: 16, scope: !950)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 288, column: 7)
!951 = distinct !DILexicalBlock(scope: !947, file: !3, line: 287, column: 21)
!952 = !DILocation(line: 288, column: 32, scope: !950)
!953 = !DILocation(line: 288, column: 48, scope: !950)
!954 = !DILocation(line: 288, column: 63, scope: !950)
!955 = !DILocation(line: 288, column: 7, scope: !950)
!956 = !DILocation(line: 288, column: 7, scope: !951)
!957 = !DILocation(line: 289, column: 11, scope: !958)
!958 = distinct !DILexicalBlock(scope: !950, file: !3, line: 288, column: 80)
!959 = !DILocation(line: 290, column: 4, scope: !958)
!960 = !DILocation(line: 292, column: 2, scope: !951)
!961 = !DILabel(scope: !766, name: "err", file: !3, line: 294)
!962 = !DILocation(line: 294, column: 1, scope: !766)
!963 = !DILocation(line: 295, column: 6, scope: !964)
!964 = distinct !DILexicalBlock(scope: !766, file: !3, line: 295, column: 6)
!965 = !DILocation(line: 295, column: 6, scope: !766)
!966 = !DILocation(line: 295, column: 24, scope: !964)
!967 = !DILocation(line: 295, column: 19, scope: !964)
!968 = !DILocation(line: 296, column: 6, scope: !969)
!969 = distinct !DILexicalBlock(scope: !766, file: !3, line: 296, column: 6)
!970 = !DILocation(line: 296, column: 6, scope: !766)
!971 = !DILocation(line: 296, column: 26, scope: !969)
!972 = !DILocation(line: 296, column: 21, scope: !969)
!973 = !DILocation(line: 297, column: 6, scope: !974)
!974 = distinct !DILexicalBlock(scope: !766, file: !3, line: 297, column: 6)
!975 = !DILocation(line: 297, column: 6, scope: !766)
!976 = !DILocation(line: 297, column: 38, scope: !974)
!977 = !DILocation(line: 297, column: 33, scope: !974)
!978 = !DILocation(line: 298, column: 9, scope: !766)
!979 = !DILocation(line: 298, column: 2, scope: !766)
!980 = !DILocation(line: 299, column: 1, scope: !766)
!981 = distinct !DISubprogram(name: "sgx_serialize_key_store", scope: !3, file: !3, line: 301, type: !525, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !370)
!982 = !DILocalVariable(name: "pms", arg: 1, scope: !981, file: !3, line: 301, type: !82)
!983 = !DILocation(line: 301, column: 61, scope: !981)
!984 = !DILocation(line: 303, column: 2, scope: !981)
!985 = !DILocation(line: 303, column: 2, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !3, line: 303, column: 2)
!987 = distinct !DILexicalBlock(scope: !981, file: !3, line: 303, column: 2)
!988 = !DILocation(line: 303, column: 2, scope: !987)
!989 = !DILocation(line: 307, column: 2, scope: !981)
!990 = !DILocalVariable(name: "ms", scope: !981, file: !3, line: 308, type: !124)
!991 = !DILocation(line: 308, column: 28, scope: !981)
!992 = !DILocation(line: 308, column: 33, scope: !981)
!993 = !DILocalVariable(name: "status", scope: !981, file: !3, line: 309, type: !147)
!994 = !DILocation(line: 309, column: 15, scope: !981)
!995 = !DILocalVariable(name: "_tmp_p_dst", scope: !981, file: !3, line: 310, type: !82)
!996 = !DILocation(line: 310, column: 8, scope: !981)
!997 = !DILocation(line: 310, column: 21, scope: !981)
!998 = !DILocation(line: 310, column: 25, scope: !981)
!999 = !DILocalVariable(name: "_len_p_dst", scope: !981, file: !3, line: 311, type: !91)
!1000 = !DILocation(line: 311, column: 9, scope: !981)
!1001 = !DILocalVariable(name: "_in_p_dst", scope: !981, file: !3, line: 312, type: !82)
!1002 = !DILocation(line: 312, column: 8, scope: !981)
!1003 = !DILocation(line: 314, column: 2, scope: !981)
!1004 = !DILocation(line: 314, column: 2, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 314, column: 2)
!1006 = distinct !DILexicalBlock(scope: !981, file: !3, line: 314, column: 2)
!1007 = !DILocation(line: 314, column: 2, scope: !1006)
!1008 = !DILocation(line: 319, column: 2, scope: !981)
!1009 = !DILocation(line: 321, column: 6, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !981, file: !3, line: 321, column: 6)
!1011 = !DILocation(line: 321, column: 17, scope: !1010)
!1012 = !DILocation(line: 321, column: 25, scope: !1010)
!1013 = !DILocation(line: 321, column: 28, scope: !1010)
!1014 = !DILocation(line: 321, column: 39, scope: !1010)
!1015 = !DILocation(line: 321, column: 6, scope: !981)
!1016 = !DILocation(line: 322, column: 34, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 322, column: 7)
!1018 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 321, column: 45)
!1019 = !DILocation(line: 322, column: 27, scope: !1017)
!1020 = !DILocation(line: 322, column: 18, scope: !1017)
!1021 = !DILocation(line: 322, column: 47, scope: !1017)
!1022 = !DILocation(line: 322, column: 7, scope: !1018)
!1023 = !DILocation(line: 323, column: 11, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 322, column: 56)
!1025 = !DILocation(line: 324, column: 4, scope: !1024)
!1026 = !DILocation(line: 327, column: 17, scope: !1018)
!1027 = !DILocation(line: 327, column: 31, scope: !1018)
!1028 = !DILocation(line: 327, column: 3, scope: !1018)
!1029 = !DILocation(line: 328, column: 2, scope: !1018)
!1030 = !DILocation(line: 330, column: 38, scope: !981)
!1031 = !DILocation(line: 330, column: 18, scope: !981)
!1032 = !DILocation(line: 330, column: 2, scope: !981)
!1033 = !DILocation(line: 330, column: 6, scope: !981)
!1034 = !DILocation(line: 330, column: 16, scope: !981)
!1035 = !DILocation(line: 331, column: 6, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !981, file: !3, line: 331, column: 6)
!1037 = !DILocation(line: 331, column: 6, scope: !981)
!1038 = !DILocation(line: 332, column: 16, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 332, column: 7)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 331, column: 17)
!1041 = !DILocation(line: 332, column: 28, scope: !1039)
!1042 = !DILocation(line: 332, column: 40, scope: !1039)
!1043 = !DILocation(line: 332, column: 51, scope: !1039)
!1044 = !DILocation(line: 332, column: 7, scope: !1039)
!1045 = !DILocation(line: 332, column: 7, scope: !1040)
!1046 = !DILocation(line: 333, column: 11, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 332, column: 64)
!1048 = !DILocation(line: 334, column: 4, scope: !1047)
!1049 = !DILocation(line: 336, column: 2, scope: !1040)
!1050 = !DILabel(scope: !981, name: "err", file: !3, line: 338)
!1051 = !DILocation(line: 338, column: 1, scope: !981)
!1052 = !DILocation(line: 339, column: 6, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !981, file: !3, line: 339, column: 6)
!1054 = !DILocation(line: 339, column: 6, scope: !981)
!1055 = !DILocation(line: 339, column: 22, scope: !1053)
!1056 = !DILocation(line: 339, column: 17, scope: !1053)
!1057 = !DILocation(line: 340, column: 9, scope: !981)
!1058 = !DILocation(line: 340, column: 2, scope: !981)
!1059 = !DILocation(line: 341, column: 1, scope: !981)
!1060 = distinct !DISubprogram(name: "sgx_decrypt_and_set_key_store", scope: !3, file: !3, line: 343, type: !525, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !370)
!1061 = !DILocalVariable(name: "pms", arg: 1, scope: !1060, file: !3, line: 343, type: !82)
!1062 = !DILocation(line: 343, column: 67, scope: !1060)
!1063 = !DILocation(line: 345, column: 2, scope: !1060)
!1064 = !DILocation(line: 345, column: 2, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 345, column: 2)
!1066 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 345, column: 2)
!1067 = !DILocation(line: 345, column: 2, scope: !1066)
!1068 = !DILocation(line: 349, column: 2, scope: !1060)
!1069 = !DILocalVariable(name: "ms", scope: !1060, file: !3, line: 350, type: !130)
!1070 = !DILocation(line: 350, column: 34, scope: !1060)
!1071 = !DILocation(line: 350, column: 39, scope: !1060)
!1072 = !DILocalVariable(name: "status", scope: !1060, file: !3, line: 351, type: !147)
!1073 = !DILocation(line: 351, column: 15, scope: !1060)
!1074 = !DILocalVariable(name: "_tmp_key_store", scope: !1060, file: !3, line: 352, type: !82)
!1075 = !DILocation(line: 352, column: 8, scope: !1060)
!1076 = !DILocation(line: 352, column: 25, scope: !1060)
!1077 = !DILocation(line: 352, column: 29, scope: !1060)
!1078 = !DILocalVariable(name: "_len_key_store", scope: !1060, file: !3, line: 353, type: !91)
!1079 = !DILocation(line: 353, column: 9, scope: !1060)
!1080 = !DILocalVariable(name: "_in_key_store", scope: !1060, file: !3, line: 354, type: !82)
!1081 = !DILocation(line: 354, column: 8, scope: !1060)
!1082 = !DILocation(line: 356, column: 2, scope: !1060)
!1083 = !DILocation(line: 356, column: 2, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 356, column: 2)
!1085 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 356, column: 2)
!1086 = !DILocation(line: 356, column: 2, scope: !1085)
!1087 = !DILocation(line: 361, column: 2, scope: !1060)
!1088 = !DILocation(line: 363, column: 6, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 363, column: 6)
!1090 = !DILocation(line: 363, column: 21, scope: !1089)
!1091 = !DILocation(line: 363, column: 29, scope: !1089)
!1092 = !DILocation(line: 363, column: 32, scope: !1089)
!1093 = !DILocation(line: 363, column: 47, scope: !1089)
!1094 = !DILocation(line: 363, column: 6, scope: !1060)
!1095 = !DILocation(line: 364, column: 33, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 363, column: 53)
!1097 = !DILocation(line: 364, column: 26, scope: !1096)
!1098 = !DILocation(line: 364, column: 17, scope: !1096)
!1099 = !DILocation(line: 365, column: 7, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 365, column: 7)
!1101 = !DILocation(line: 365, column: 21, scope: !1100)
!1102 = !DILocation(line: 365, column: 7, scope: !1096)
!1103 = !DILocation(line: 366, column: 11, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 365, column: 30)
!1105 = !DILocation(line: 367, column: 4, scope: !1104)
!1106 = !DILocation(line: 370, column: 16, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 370, column: 7)
!1108 = !DILocation(line: 370, column: 31, scope: !1107)
!1109 = !DILocation(line: 370, column: 47, scope: !1107)
!1110 = !DILocation(line: 370, column: 63, scope: !1107)
!1111 = !DILocation(line: 370, column: 7, scope: !1107)
!1112 = !DILocation(line: 370, column: 7, scope: !1096)
!1113 = !DILocation(line: 371, column: 11, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 370, column: 80)
!1115 = !DILocation(line: 372, column: 4, scope: !1114)
!1116 = !DILocation(line: 375, column: 2, scope: !1096)
!1117 = !DILocation(line: 377, column: 44, scope: !1060)
!1118 = !DILocation(line: 377, column: 18, scope: !1060)
!1119 = !DILocation(line: 377, column: 2, scope: !1060)
!1120 = !DILocation(line: 377, column: 6, scope: !1060)
!1121 = !DILocation(line: 377, column: 16, scope: !1060)
!1122 = !DILabel(scope: !1060, name: "err", file: !3, line: 379)
!1123 = !DILocation(line: 379, column: 1, scope: !1060)
!1124 = !DILocation(line: 380, column: 6, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 380, column: 6)
!1126 = !DILocation(line: 380, column: 6, scope: !1060)
!1127 = !DILocation(line: 380, column: 26, scope: !1125)
!1128 = !DILocation(line: 380, column: 21, scope: !1125)
!1129 = !DILocation(line: 381, column: 9, scope: !1060)
!1130 = !DILocation(line: 381, column: 2, scope: !1060)
!1131 = !DILocation(line: 382, column: 1, scope: !1060)
!1132 = distinct !DISubprogram(name: "sgx_encrypt_and_serialize_key_store", scope: !3, file: !3, line: 384, type: !525, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !370)
!1133 = !DILocalVariable(name: "pms", arg: 1, scope: !1132, file: !3, line: 384, type: !82)
!1134 = !DILocation(line: 384, column: 73, scope: !1132)
!1135 = !DILocation(line: 386, column: 2, scope: !1132)
!1136 = !DILocation(line: 386, column: 2, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 386, column: 2)
!1138 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 386, column: 2)
!1139 = !DILocation(line: 386, column: 2, scope: !1138)
!1140 = !DILocation(line: 390, column: 2, scope: !1132)
!1141 = !DILocalVariable(name: "ms", scope: !1132, file: !3, line: 391, type: !136)
!1142 = !DILocation(line: 391, column: 40, scope: !1132)
!1143 = !DILocation(line: 391, column: 45, scope: !1132)
!1144 = !DILocalVariable(name: "status", scope: !1132, file: !3, line: 392, type: !147)
!1145 = !DILocation(line: 392, column: 15, scope: !1132)
!1146 = !DILocalVariable(name: "_tmp_p_dst", scope: !1132, file: !3, line: 393, type: !82)
!1147 = !DILocation(line: 393, column: 8, scope: !1132)
!1148 = !DILocation(line: 393, column: 21, scope: !1132)
!1149 = !DILocation(line: 393, column: 25, scope: !1132)
!1150 = !DILocalVariable(name: "_len_p_dst", scope: !1132, file: !3, line: 394, type: !91)
!1151 = !DILocation(line: 394, column: 9, scope: !1132)
!1152 = !DILocalVariable(name: "_in_p_dst", scope: !1132, file: !3, line: 395, type: !82)
!1153 = !DILocation(line: 395, column: 8, scope: !1132)
!1154 = !DILocation(line: 397, column: 2, scope: !1132)
!1155 = !DILocation(line: 397, column: 2, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 397, column: 2)
!1157 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 397, column: 2)
!1158 = !DILocation(line: 397, column: 2, scope: !1157)
!1159 = !DILocation(line: 402, column: 2, scope: !1132)
!1160 = !DILocation(line: 404, column: 6, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 404, column: 6)
!1162 = !DILocation(line: 404, column: 17, scope: !1161)
!1163 = !DILocation(line: 404, column: 25, scope: !1161)
!1164 = !DILocation(line: 404, column: 28, scope: !1161)
!1165 = !DILocation(line: 404, column: 39, scope: !1161)
!1166 = !DILocation(line: 404, column: 6, scope: !1132)
!1167 = !DILocation(line: 405, column: 34, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 405, column: 7)
!1169 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 404, column: 45)
!1170 = !DILocation(line: 405, column: 27, scope: !1168)
!1171 = !DILocation(line: 405, column: 18, scope: !1168)
!1172 = !DILocation(line: 405, column: 47, scope: !1168)
!1173 = !DILocation(line: 405, column: 7, scope: !1169)
!1174 = !DILocation(line: 406, column: 11, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 405, column: 56)
!1176 = !DILocation(line: 407, column: 4, scope: !1175)
!1177 = !DILocation(line: 410, column: 17, scope: !1169)
!1178 = !DILocation(line: 410, column: 31, scope: !1169)
!1179 = !DILocation(line: 410, column: 3, scope: !1169)
!1180 = !DILocation(line: 411, column: 2, scope: !1169)
!1181 = !DILocation(line: 413, column: 50, scope: !1132)
!1182 = !DILocation(line: 413, column: 18, scope: !1132)
!1183 = !DILocation(line: 413, column: 2, scope: !1132)
!1184 = !DILocation(line: 413, column: 6, scope: !1132)
!1185 = !DILocation(line: 413, column: 16, scope: !1132)
!1186 = !DILocation(line: 414, column: 6, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 414, column: 6)
!1188 = !DILocation(line: 414, column: 6, scope: !1132)
!1189 = !DILocation(line: 415, column: 16, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 415, column: 7)
!1191 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 414, column: 17)
!1192 = !DILocation(line: 415, column: 28, scope: !1190)
!1193 = !DILocation(line: 415, column: 40, scope: !1190)
!1194 = !DILocation(line: 415, column: 51, scope: !1190)
!1195 = !DILocation(line: 415, column: 7, scope: !1190)
!1196 = !DILocation(line: 415, column: 7, scope: !1191)
!1197 = !DILocation(line: 416, column: 11, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 415, column: 64)
!1199 = !DILocation(line: 417, column: 4, scope: !1198)
!1200 = !DILocation(line: 419, column: 2, scope: !1191)
!1201 = !DILabel(scope: !1132, name: "err", file: !3, line: 421)
!1202 = !DILocation(line: 421, column: 1, scope: !1132)
!1203 = !DILocation(line: 422, column: 6, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 422, column: 6)
!1205 = !DILocation(line: 422, column: 6, scope: !1132)
!1206 = !DILocation(line: 422, column: 22, scope: !1204)
!1207 = !DILocation(line: 422, column: 17, scope: !1204)
!1208 = !DILocation(line: 423, column: 9, scope: !1132)
!1209 = !DILocation(line: 423, column: 2, scope: !1132)
!1210 = !DILocation(line: 424, column: 1, scope: !1132)
!1211 = distinct !DISubprogram(name: "sgx_seal", scope: !3, file: !3, line: 426, type: !525, scopeLine: 427, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !370)
!1212 = !DILocalVariable(name: "pms", arg: 1, scope: !1211, file: !3, line: 426, type: !82)
!1213 = !DILocation(line: 426, column: 46, scope: !1211)
!1214 = !DILocation(line: 428, column: 2, scope: !1211)
!1215 = !DILocation(line: 428, column: 2, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1217, file: !3, line: 428, column: 2)
!1217 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 428, column: 2)
!1218 = !DILocation(line: 428, column: 2, scope: !1217)
!1219 = !DILocation(line: 432, column: 2, scope: !1211)
!1220 = !DILocalVariable(name: "ms", scope: !1211, file: !3, line: 433, type: !142)
!1221 = !DILocation(line: 433, column: 13, scope: !1211)
!1222 = !DILocation(line: 433, column: 18, scope: !1211)
!1223 = !DILocalVariable(name: "status", scope: !1211, file: !3, line: 434, type: !147)
!1224 = !DILocation(line: 434, column: 15, scope: !1211)
!1225 = !DILocalVariable(name: "_tmp_plaintext", scope: !1211, file: !3, line: 435, type: !149)
!1226 = !DILocation(line: 435, column: 11, scope: !1211)
!1227 = !DILocation(line: 435, column: 28, scope: !1211)
!1228 = !DILocation(line: 435, column: 32, scope: !1211)
!1229 = !DILocalVariable(name: "_tmp_plaintext_len", scope: !1211, file: !3, line: 436, type: !91)
!1230 = !DILocation(line: 436, column: 9, scope: !1211)
!1231 = !DILocation(line: 436, column: 30, scope: !1211)
!1232 = !DILocation(line: 436, column: 34, scope: !1211)
!1233 = !DILocalVariable(name: "_len_plaintext", scope: !1211, file: !3, line: 437, type: !91)
!1234 = !DILocation(line: 437, column: 9, scope: !1211)
!1235 = !DILocation(line: 437, column: 26, scope: !1211)
!1236 = !DILocalVariable(name: "_in_plaintext", scope: !1211, file: !3, line: 438, type: !149)
!1237 = !DILocation(line: 438, column: 11, scope: !1211)
!1238 = !DILocalVariable(name: "_tmp_sealed_data", scope: !1211, file: !3, line: 439, type: !156)
!1239 = !DILocation(line: 439, column: 21, scope: !1211)
!1240 = !DILocation(line: 439, column: 40, scope: !1211)
!1241 = !DILocation(line: 439, column: 44, scope: !1211)
!1242 = !DILocalVariable(name: "_tmp_sealed_size", scope: !1211, file: !3, line: 440, type: !91)
!1243 = !DILocation(line: 440, column: 9, scope: !1211)
!1244 = !DILocation(line: 440, column: 28, scope: !1211)
!1245 = !DILocation(line: 440, column: 32, scope: !1211)
!1246 = !DILocalVariable(name: "_len_sealed_data", scope: !1211, file: !3, line: 441, type: !91)
!1247 = !DILocation(line: 441, column: 9, scope: !1211)
!1248 = !DILocation(line: 441, column: 28, scope: !1211)
!1249 = !DILocalVariable(name: "_in_sealed_data", scope: !1211, file: !3, line: 442, type: !156)
!1250 = !DILocation(line: 442, column: 21, scope: !1211)
!1251 = !DILocation(line: 444, column: 2, scope: !1211)
!1252 = !DILocation(line: 444, column: 2, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1254, file: !3, line: 444, column: 2)
!1254 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 444, column: 2)
!1255 = !DILocation(line: 444, column: 2, scope: !1254)
!1256 = !DILocation(line: 445, column: 2, scope: !1211)
!1257 = !DILocation(line: 445, column: 2, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1259, file: !3, line: 445, column: 2)
!1259 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 445, column: 2)
!1260 = !DILocation(line: 445, column: 2, scope: !1259)
!1261 = !DILocation(line: 450, column: 2, scope: !1211)
!1262 = !DILocation(line: 452, column: 6, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 452, column: 6)
!1264 = !DILocation(line: 452, column: 21, scope: !1263)
!1265 = !DILocation(line: 452, column: 29, scope: !1263)
!1266 = !DILocation(line: 452, column: 32, scope: !1263)
!1267 = !DILocation(line: 452, column: 47, scope: !1263)
!1268 = !DILocation(line: 452, column: 6, scope: !1211)
!1269 = !DILocation(line: 453, column: 8, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1271, file: !3, line: 453, column: 8)
!1271 = distinct !DILexicalBlock(scope: !1263, file: !3, line: 452, column: 53)
!1272 = !DILocation(line: 453, column: 23, scope: !1270)
!1273 = !DILocation(line: 453, column: 49, scope: !1270)
!1274 = !DILocation(line: 453, column: 8, scope: !1271)
!1275 = !DILocation(line: 455, column: 11, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1270, file: !3, line: 454, column: 3)
!1277 = !DILocation(line: 456, column: 4, scope: !1276)
!1278 = !DILocation(line: 458, column: 36, scope: !1271)
!1279 = !DILocation(line: 458, column: 29, scope: !1271)
!1280 = !DILocation(line: 458, column: 17, scope: !1271)
!1281 = !DILocation(line: 459, column: 7, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1271, file: !3, line: 459, column: 7)
!1283 = !DILocation(line: 459, column: 21, scope: !1282)
!1284 = !DILocation(line: 459, column: 7, scope: !1271)
!1285 = !DILocation(line: 460, column: 11, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1282, file: !3, line: 459, column: 30)
!1287 = !DILocation(line: 461, column: 4, scope: !1286)
!1288 = !DILocation(line: 464, column: 16, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1271, file: !3, line: 464, column: 7)
!1290 = !DILocation(line: 464, column: 31, scope: !1289)
!1291 = !DILocation(line: 464, column: 47, scope: !1289)
!1292 = !DILocation(line: 464, column: 63, scope: !1289)
!1293 = !DILocation(line: 464, column: 7, scope: !1289)
!1294 = !DILocation(line: 464, column: 7, scope: !1271)
!1295 = !DILocation(line: 465, column: 11, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1289, file: !3, line: 464, column: 80)
!1297 = !DILocation(line: 466, column: 4, scope: !1296)
!1298 = !DILocation(line: 469, column: 2, scope: !1271)
!1299 = !DILocation(line: 470, column: 6, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 470, column: 6)
!1301 = !DILocation(line: 470, column: 23, scope: !1300)
!1302 = !DILocation(line: 470, column: 31, scope: !1300)
!1303 = !DILocation(line: 470, column: 34, scope: !1300)
!1304 = !DILocation(line: 470, column: 51, scope: !1300)
!1305 = !DILocation(line: 470, column: 6, scope: !1211)
!1306 = !DILocation(line: 471, column: 53, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1308, file: !3, line: 471, column: 7)
!1308 = distinct !DILexicalBlock(scope: !1300, file: !3, line: 470, column: 57)
!1309 = !DILocation(line: 471, column: 46, scope: !1307)
!1310 = !DILocation(line: 471, column: 26, scope: !1307)
!1311 = !DILocation(line: 471, column: 24, scope: !1307)
!1312 = !DILocation(line: 471, column: 72, scope: !1307)
!1313 = !DILocation(line: 471, column: 7, scope: !1308)
!1314 = !DILocation(line: 472, column: 11, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1307, file: !3, line: 471, column: 81)
!1316 = !DILocation(line: 473, column: 4, scope: !1315)
!1317 = !DILocation(line: 476, column: 17, scope: !1308)
!1318 = !DILocation(line: 476, column: 3, scope: !1308)
!1319 = !DILocation(line: 476, column: 37, scope: !1308)
!1320 = !DILocation(line: 477, column: 2, scope: !1308)
!1321 = !DILocation(line: 479, column: 23, scope: !1211)
!1322 = !DILocation(line: 479, column: 38, scope: !1211)
!1323 = !DILocation(line: 479, column: 58, scope: !1211)
!1324 = !DILocation(line: 479, column: 75, scope: !1211)
!1325 = !DILocation(line: 479, column: 18, scope: !1211)
!1326 = !DILocation(line: 479, column: 2, scope: !1211)
!1327 = !DILocation(line: 479, column: 6, scope: !1211)
!1328 = !DILocation(line: 479, column: 16, scope: !1211)
!1329 = !DILocation(line: 480, column: 6, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1211, file: !3, line: 480, column: 6)
!1331 = !DILocation(line: 480, column: 6, scope: !1211)
!1332 = !DILocation(line: 481, column: 16, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1334, file: !3, line: 481, column: 7)
!1334 = distinct !DILexicalBlock(scope: !1330, file: !3, line: 480, column: 23)
!1335 = !DILocation(line: 481, column: 34, scope: !1333)
!1336 = !DILocation(line: 481, column: 52, scope: !1333)
!1337 = !DILocation(line: 481, column: 69, scope: !1333)
!1338 = !DILocation(line: 481, column: 7, scope: !1333)
!1339 = !DILocation(line: 481, column: 7, scope: !1334)
!1340 = !DILocation(line: 482, column: 11, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1333, file: !3, line: 481, column: 88)
!1342 = !DILocation(line: 483, column: 4, scope: !1341)
!1343 = !DILocation(line: 485, column: 2, scope: !1334)
!1344 = !DILabel(scope: !1211, name: "err", file: !3, line: 487)
